***********************************************************************
* Projeto 7 - BMS Map - IBM CICS reference syntax
* Mapset: CLISET
* Map:    CLIMAP
***********************************************************************
CLISET   DFHMSD TYPE=&SYSPARM,MODE=INOUT,LANG=COBOL,STORAGE=AUTO,      X
               TIOAPFX=YES,CTRL=FREEKB
CLIMAP   DFHMDI SIZE=(24,80),LINE=1,COLUMN=1
         DFHMDF POS=(1,1),LENGTH=40,ATTRB=(ASKIP,NORM),               X
               INITIAL='****************************************'
         DFHMDF POS=(2,1),LENGTH=40,ATTRB=(ASKIP,NORM),               X
               INITIAL='* CONSULTA DE CLIENTES                 *'
         DFHMDF POS=(3,1),LENGTH=40,ATTRB=(ASKIP,NORM),               X
               INITIAL='****************************************'
         DFHMDF POS=(5,1),LENGTH=15,ATTRB=(ASKIP,NORM),               X
               INITIAL='CODIGO CLIENTE:'
CODCLI   DFHMDF POS=(5,17),LENGTH=6,ATTRB=(UNPROT,NUM,FSET)
         DFHMDF POS=(6,1),LENGTH=15,ATTRB=(ASKIP,NORM),               X
               INITIAL='NOME..........:'
NOME     DFHMDF POS=(6,17),LENGTH=30,ATTRB=(PROT,NORM)
         DFHMDF POS=(7,1),LENGTH=15,ATTRB=(ASKIP,NORM),               X
               INITIAL='TELEFONE......:'
FONE     DFHMDF POS=(7,17),LENGTH=15,ATTRB=(UNPROT,FSET)
         DFHMDF POS=(8,1),LENGTH=15,ATTRB=(ASKIP,NORM),               X
               INITIAL='CIDADE........:'
CIDADE   DFHMDF POS=(8,17),LENGTH=20,ATTRB=(UNPROT,FSET)
         DFHMDF POS=(10,1),LENGTH=15,ATTRB=(ASKIP,NORM),              X
               INITIAL='MENSAGEM......:'
MSG      DFHMDF POS=(10,17),LENGTH=40,ATTRB=(PROT,NORM)
         DFHMDF POS=(12,1),LENGTH=8,ATTRB=(ASKIP,NORM),               X
               INITIAL='PF3=SAIR'
         DFHMDF POS=(12,13),LENGTH=13,ATTRB=(ASKIP,NORM),             X
               INITIAL='PF5=CONSULTAR'
         DFHMDF POS=(12,28),LENGTH=10,ATTRB=(ASKIP,NORM),             X
               INITIAL='PF6=SALVAR'
         DFHMSD TYPE=FINAL
         END
