//HERC010A JOB (COBOL),
//             'CRIA ARQ ORDENADO',
//             CLASS=A,
//             MSGCLASS=H,
//             REGION=8M,TIME=1440
//IEFBR14  EXEC PGM=IEFBR14
//SYSPRINT DD   SYSOUT=*
//ENTRADA  DD   DUMMY
//ARQUIVO  DD   DSN=HERC01.CONTAS.ORDENADO,DISP=(NEW,CATLG,DELETE),
//              SPACE=(TRK,(1,1),RLSE),
//              UNIT=SYSDA,
//              DCB=(RECFM=FB,LRECL=54,BLKSIZE=19062,BUFNO=2)
