       IDENTIFICATION                  DIVISION.
       PROGRAM-ID. PROG05.
       AUTHOR. ADRIEL FREZATTI.

       ENVIRONMENT                     DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT ARQ-CLIENTES ASSIGN TO UT-S-CLIENTES.
           SELECT ARQ-TRANSACOES ASSIGN TO UT-S-TRANSAC.
           SELECT ARQ-ATUALIZADO ASSIGN TO UT-S-ATUAL.
           SELECT ARQ-ERROS ASSIGN TO UT-S-ERROS.
           SELECT ARQ-SAIDA ASSIGN TO UT-S-SAIDA.

       DATA DIVISION.
       FILE SECTION.

       FD  ARQ-CLIENTES
           LABEL RECORDS ARE STANDARD
           BLOCK CONTAINS 10 RECORDS
           RECORD CONTAINS 44 CHARACTERS
           RECORDING MODE IS F
           DATA RECORD IS REG-CLIENTE.
       01  REG-CLIENTE.
           05 CLI-ID             PIC 9(05).
           05 CLI-NOME           PIC X(30).
           05 CLI-SALDO          PIC 9(09).

       FD  ARQ-TRANSACOES
           LABEL RECORDS ARE STANDARD
           BLOCK CONTAINS 10 RECORDS
           RECORD CONTAINS 20 CHARACTERS
           RECORDING MODE IS F
           DATA RECORD IS REG-TRANSACAO.
       01  REG-TRANSACAO.
           05 TRX-CLI-ID         PIC 9(05).
           05 TRX-ID             PIC 9(05).
           05 TRX-TIPO           PIC X(01).
           05 TRX-VALOR          PIC 9(09).

       FD  ARQ-ATUALIZADO
           LABEL RECORDS ARE STANDARD
           BLOCK CONTAINS 10 RECORDS
           RECORD CONTAINS 44 CHARACTERS
           RECORDING MODE IS F
           DATA RECORD IS REG-CLIENTE-ATU.
       01  REG-CLIENTE-ATU.
           05 ATU-CLI-ID         PIC 9(05).
           05 ATU-CLI-NOME       PIC X(30).
           05 ATU-CLI-SALDO      PIC 9(09).

       FD  ARQ-ERROS
           LABEL RECORDS ARE STANDARD
           BLOCK CONTAINS 10 RECORDS
           RECORD CONTAINS 80 CHARACTERS
           RECORDING MODE IS F
           DATA RECORD IS REG-ERRO.
       01  REG-ERRO              PIC X(80).

       FD  ARQ-SAIDA
           LABEL RECORDS ARE STANDARD
           BLOCK CONTAINS 1 RECORDS
           RECORD CONTAINS 132 CHARACTERS
           RECORDING MODE IS F
           DATA RECORD IS REG-SAIDA.
       01  REG-SAIDA             PIC X(132).

       WORKING-STORAGE SECTION.

       01  WRK-FIM-CLIENTES      PIC X(01) VALUE 'N'.
       01  WRK-FIM-TRANSACOES    PIC X(01) VALUE 'N'.

       01  WRK-TOT-CREDITOS-CLI  PIC 9(09) VALUE ZEROS.
       01  WRK-TOT-DEBITOS-CLI   PIC 9(09) VALUE ZEROS.

       01  WRK-CLI-PROCESSADOS   PIC 9(06) VALUE ZEROS.
       01  WRK-TRX-PROCESSADAS   PIC 9(06) VALUE ZEROS.
       01  WRK-CRE-PROCESSADOS   PIC 9(06) VALUE ZEROS.
       01  WRK-DEB-PROCESSADOS   PIC 9(06) VALUE ZEROS.
       01  WRK-ERROS-ENCONTRADOS PIC 9(06) VALUE ZEROS.

       01  WRK-LINHA-CLIENTE.
           05 FILLER             PIC X(09) VALUE 'CLIENTE: '.
           05 WRK-REL-CLI-ID     PIC 9(05).
           05 FILLER             PIC X(118) VALUE SPACES.

       01  WRK-LINHA-CREDITOS.
           05 FILLER             PIC X(16)
              VALUE 'TOTAL CREDITOS: '.
           05 WRK-REL-CREDITOS   PIC 9(09).
           05 FILLER             PIC X(107) VALUE SPACES.

       01  WRK-LINHA-DEBITOS.
           05 FILLER             PIC X(15)
              VALUE 'TOTAL DEBITOS: '.
           05 WRK-REL-DEBITOS    PIC 9(09).
           05 FILLER             PIC X(108) VALUE SPACES.

       01  WRK-LINHA-CLI-PROC.
           05 FILLER             PIC X(27)
              VALUE 'CLIENTES PROCESSADOS.....: '.
           05 WRK-REL-CLI-PROC   PIC 9(06).
           05 FILLER             PIC X(99) VALUE SPACES.

       01  WRK-LINHA-TRX-PROC.
           05 FILLER             PIC X(27)
              VALUE 'TRANSACOES PROCESSADAS...: '.
           05 WRK-REL-TRX-PROC   PIC 9(06).
           05 FILLER             PIC X(99) VALUE SPACES.

       01  WRK-LINHA-CRE-PROC.
           05 FILLER             PIC X(27)
              VALUE 'CREDITOS PROCESSADOS.....: '.
           05 WRK-REL-CRE-PROC   PIC 9(06).
           05 FILLER             PIC X(99) VALUE SPACES.

       01  WRK-LINHA-DEB-PROC.
           05 FILLER             PIC X(27)
              VALUE 'DEBITOS PROCESSADOS......: '.
           05 WRK-REL-DEB-PROC   PIC 9(06).
           05 FILLER             PIC X(99) VALUE SPACES.

       01  WRK-LINHA-ERROS.
           05 FILLER             PIC X(27)
              VALUE 'ERROS ENCONTRADOS........: '.
           05 WRK-REL-ERROS      PIC 9(06).
           05 FILLER             PIC X(99) VALUE SPACES.

       01  WRK-ERRO-CLIENTE.
           05 FILLER             PIC X(34)
              VALUE 'ERRO: CLIENTE NAO ENCONTRADO - ID '.
           05 WRK-ERR-CLI-ID     PIC 9(05).
           05 FILLER             PIC X(41) VALUE SPACES.

       01  WRK-ERRO-TIPO.
           05 FILLER             PIC X(38)
              VALUE 'ERRO: TIPO DE TRANSACAO INVALIDO - ID '.
           05 WRK-ERR-TIPO-ID    PIC 9(05).
           05 FILLER             PIC X(37) VALUE SPACES.

       01  WRK-ERRO-VALOR.
           05 FILLER             PIC X(39)
              VALUE 'ERRO: VALOR DE TRANSACAO INVALIDO - ID '.
           05 WRK-ERR-VALOR-ID   PIC 9(05).
           05 FILLER             PIC X(36) VALUE SPACES.

       01  WRK-ERRO-SALDO.
           05 FILLER             PIC X(30)
              VALUE 'ERRO: SALDO INSUFICIENTE - ID '.
           05 WRK-ERR-SALDO-ID   PIC 9(05).
           05 FILLER             PIC X(45) VALUE SPACES.

       PROCEDURE DIVISION.

       MAIN-PROCEDURE.
           PERFORM ABRIR-ARQUIVOS THRU ABRIR-ARQUIVOS-FIM.
           PERFORM FLUXO-MERGE THRU FLUXO-MERGE-FIM
               UNTIL WRK-FIM-CLIENTES = 'S'
                 AND WRK-FIM-TRANSACOES = 'S'.
           PERFORM EXIBIR-ESTATISTICAS
               THRU EXIBIR-ESTATISTICAS-FIM.
           PERFORM FECHAR-ARQUIVOS THRU FECHAR-ARQUIVOS-FIM.
           STOP RUN.

       ABRIR-ARQUIVOS.
           OPEN INPUT ARQ-CLIENTES ARQ-TRANSACOES
                OUTPUT ARQ-ATUALIZADO ARQ-ERROS ARQ-SAIDA.
           MOVE ZEROS TO WRK-TOT-CREDITOS-CLI.
           MOVE ZEROS TO WRK-TOT-DEBITOS-CLI.
           MOVE ZEROS TO WRK-CLI-PROCESSADOS.
           MOVE ZEROS TO WRK-TRX-PROCESSADAS.
           MOVE ZEROS TO WRK-CRE-PROCESSADOS.
           MOVE ZEROS TO WRK-DEB-PROCESSADOS.
           MOVE ZEROS TO WRK-ERROS-ENCONTRADOS.
           PERFORM LER-CLIENTE THRU LER-CLIENTE-FIM.
           PERFORM LER-TRANSACAO THRU LER-TRANSACAO-FIM.
       ABRIR-ARQUIVOS-FIM.
           EXIT.

       FLUXO-MERGE.
           IF WRK-FIM-CLIENTES = 'S'
               PERFORM TRANSACAO-SEM-CLIENTE
                   THRU TRANSACAO-SEM-CLIENTE-FIM
               GO TO FLUXO-MERGE-FIM.
           IF WRK-FIM-TRANSACOES = 'S'
               PERFORM FINALIZAR-CLIENTE
                   THRU FINALIZAR-CLIENTE-FIM
               GO TO FLUXO-MERGE-FIM.
           IF CLI-ID < TRX-CLI-ID
               PERFORM FINALIZAR-CLIENTE
                   THRU FINALIZAR-CLIENTE-FIM
               GO TO FLUXO-MERGE-FIM.
           IF CLI-ID > TRX-CLI-ID
               PERFORM TRANSACAO-SEM-CLIENTE
                   THRU TRANSACAO-SEM-CLIENTE-FIM
               GO TO FLUXO-MERGE-FIM.
           PERFORM PROCESSAR-TRANSACAO
               THRU PROCESSAR-TRANSACAO-FIM.
       FLUXO-MERGE-FIM.
           EXIT.

       LER-CLIENTE.
           READ ARQ-CLIENTES
               AT END MOVE 'S' TO WRK-FIM-CLIENTES.
       LER-CLIENTE-FIM.
           EXIT.

       LER-TRANSACAO.
           READ ARQ-TRANSACOES
               AT END MOVE 'S' TO WRK-FIM-TRANSACOES.
       LER-TRANSACAO-FIM.
           EXIT.

       PROCESSAR-TRANSACAO.
           ADD 1 TO WRK-TRX-PROCESSADAS.
           IF TRX-TIPO NOT = 'C' AND TRX-TIPO NOT = 'D'
               PERFORM GRAVAR-ERRO-TIPO
                   THRU GRAVAR-ERRO-TIPO-FIM
               PERFORM LER-TRANSACAO THRU LER-TRANSACAO-FIM
               GO TO PROCESSAR-TRANSACAO-FIM.
           IF TRX-VALOR = ZEROS
               PERFORM GRAVAR-ERRO-VALOR
                   THRU GRAVAR-ERRO-VALOR-FIM
               PERFORM LER-TRANSACAO THRU LER-TRANSACAO-FIM
               GO TO PROCESSAR-TRANSACAO-FIM.
           IF TRX-TIPO = 'C'
               PERFORM PROCESSAR-CREDITO
                   THRU PROCESSAR-CREDITO-FIM
               PERFORM LER-TRANSACAO THRU LER-TRANSACAO-FIM
               GO TO PROCESSAR-TRANSACAO-FIM.
           PERFORM PROCESSAR-DEBITO THRU PROCESSAR-DEBITO-FIM.
           PERFORM LER-TRANSACAO THRU LER-TRANSACAO-FIM.
       PROCESSAR-TRANSACAO-FIM.
           EXIT.

       PROCESSAR-CREDITO.
           ADD TRX-VALOR TO CLI-SALDO.
           ADD TRX-VALOR TO WRK-TOT-CREDITOS-CLI.
           ADD 1 TO WRK-CRE-PROCESSADOS.
       PROCESSAR-CREDITO-FIM.
           EXIT.

       PROCESSAR-DEBITO.
           IF TRX-VALOR > CLI-SALDO
               PERFORM GRAVAR-ERRO-SALDO
                   THRU GRAVAR-ERRO-SALDO-FIM
           ELSE
               SUBTRACT TRX-VALOR FROM CLI-SALDO
               ADD TRX-VALOR TO WRK-TOT-DEBITOS-CLI
               ADD 1 TO WRK-DEB-PROCESSADOS.
       PROCESSAR-DEBITO-FIM.
           EXIT.

       TRANSACAO-SEM-CLIENTE.
           ADD 1 TO WRK-TRX-PROCESSADAS.
           PERFORM GRAVAR-ERRO-CLIENTE
               THRU GRAVAR-ERRO-CLIENTE-FIM.
           PERFORM LER-TRANSACAO THRU LER-TRANSACAO-FIM.
       TRANSACAO-SEM-CLIENTE-FIM.
           EXIT.

       FINALIZAR-CLIENTE.
           MOVE CLI-ID TO ATU-CLI-ID.
           MOVE CLI-NOME TO ATU-CLI-NOME.
           MOVE CLI-SALDO TO ATU-CLI-SALDO.
           WRITE REG-CLIENTE-ATU.
           PERFORM GERAR-RELATORIO-CLIENTE
               THRU GERAR-RELATORIO-CLIENTE-FIM.
           ADD 1 TO WRK-CLI-PROCESSADOS.
           MOVE ZEROS TO WRK-TOT-CREDITOS-CLI.
           MOVE ZEROS TO WRK-TOT-DEBITOS-CLI.
           PERFORM LER-CLIENTE THRU LER-CLIENTE-FIM.
       FINALIZAR-CLIENTE-FIM.
           EXIT.

       GERAR-RELATORIO-CLIENTE.
           MOVE CLI-ID TO WRK-REL-CLI-ID.
           MOVE WRK-TOT-CREDITOS-CLI TO WRK-REL-CREDITOS.
           MOVE WRK-TOT-DEBITOS-CLI TO WRK-REL-DEBITOS.
           MOVE WRK-LINHA-CLIENTE TO REG-SAIDA.
           WRITE REG-SAIDA.
           MOVE WRK-LINHA-CREDITOS TO REG-SAIDA.
           WRITE REG-SAIDA.
           MOVE WRK-LINHA-DEBITOS TO REG-SAIDA.
           WRITE REG-SAIDA.
           MOVE SPACES TO REG-SAIDA.
           WRITE REG-SAIDA.
       GERAR-RELATORIO-CLIENTE-FIM.
           EXIT.

       GRAVAR-ERRO-CLIENTE.
           MOVE TRX-CLI-ID TO WRK-ERR-CLI-ID.
           MOVE WRK-ERRO-CLIENTE TO REG-ERRO.
           WRITE REG-ERRO.
           ADD 1 TO WRK-ERROS-ENCONTRADOS.
       GRAVAR-ERRO-CLIENTE-FIM.
           EXIT.

       GRAVAR-ERRO-TIPO.
           MOVE TRX-CLI-ID TO WRK-ERR-TIPO-ID.
           MOVE WRK-ERRO-TIPO TO REG-ERRO.
           WRITE REG-ERRO.
           ADD 1 TO WRK-ERROS-ENCONTRADOS.
       GRAVAR-ERRO-TIPO-FIM.
           EXIT.

       GRAVAR-ERRO-VALOR.
           MOVE TRX-CLI-ID TO WRK-ERR-VALOR-ID.
           MOVE WRK-ERRO-VALOR TO REG-ERRO.
           WRITE REG-ERRO.
           ADD 1 TO WRK-ERROS-ENCONTRADOS.
       GRAVAR-ERRO-VALOR-FIM.
           EXIT.

       GRAVAR-ERRO-SALDO.
           MOVE TRX-CLI-ID TO WRK-ERR-SALDO-ID.
           MOVE WRK-ERRO-SALDO TO REG-ERRO.
           WRITE REG-ERRO.
           ADD 1 TO WRK-ERROS-ENCONTRADOS.
       GRAVAR-ERRO-SALDO-FIM.
           EXIT.

       EXIBIR-ESTATISTICAS.
           MOVE WRK-CLI-PROCESSADOS TO WRK-REL-CLI-PROC.
           MOVE WRK-TRX-PROCESSADAS TO WRK-REL-TRX-PROC.
           MOVE WRK-CRE-PROCESSADOS TO WRK-REL-CRE-PROC.
           MOVE WRK-DEB-PROCESSADOS TO WRK-REL-DEB-PROC.
           MOVE WRK-ERROS-ENCONTRADOS TO WRK-REL-ERROS.
           MOVE '****************************************'
               TO REG-SAIDA.
           WRITE REG-SAIDA.
           MOVE 'ESTATISTICAS DE PROCESSAMENTO' TO REG-SAIDA.
           WRITE REG-SAIDA.
           MOVE '****************************************'
               TO REG-SAIDA.
           WRITE REG-SAIDA.
           MOVE WRK-LINHA-CLI-PROC TO REG-SAIDA.
           WRITE REG-SAIDA.
           MOVE WRK-LINHA-TRX-PROC TO REG-SAIDA.
           WRITE REG-SAIDA.
           MOVE WRK-LINHA-CRE-PROC TO REG-SAIDA.
           WRITE REG-SAIDA.
           MOVE WRK-LINHA-DEB-PROC TO REG-SAIDA.
           WRITE REG-SAIDA.
           MOVE WRK-LINHA-ERROS TO REG-SAIDA.
           WRITE REG-SAIDA.
           MOVE 'FIM DO PROCESSAMENTO' TO REG-SAIDA.
           WRITE REG-SAIDA.
       EXIBIR-ESTATISTICAS-FIM.
           EXIT.

       FECHAR-ARQUIVOS.
           CLOSE ARQ-CLIENTES ARQ-TRANSACOES
                 ARQ-ATUALIZADO ARQ-ERROS ARQ-SAIDA.
       FECHAR-ARQUIVOS-FIM.
           EXIT.
