       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGO4.
       AUTHOR. ADRIEL.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT ARQ-CONTAS ASSIGN TO UT-S-ENTRADA.
           SELECT ARQ-SAIDA ASSIGN TO UT-S-SAIDA.
       DATA DIVISION.
       FILE SECTION.
       FD  ARQ-CONTAS
           LABEL RECORDS ARE STANDARD
           BLOCK CONTAINS 10 RECORDS
           RECORD CONTAINS 54 CHARACTERS
           RECORDING MODE IS F
           DATA RECORD IS REG-CONTA.
       01  REG-CONTA.
           05 NUM-CONTA PIC X(08).
           05 NOME-CLIENTE PIC X(30).
           05 AGENCIA PIC X(04).
           05 TIPO-CONTA PIC X(01).
           05 SALDO PIC 9(08)V99.
           05 FILLER PIC X(01).
       FD  ARQ-SAIDA
           LABEL RECORDS ARE STANDARD
           BLOCK CONTAINS 1 RECORDS
           RECORD CONTAINS 132 CHARACTERS
           RECORDING MODE IS F
           DATA RECORD IS REG-SAIDA.
       01  REG-SAIDA PIC X(132).
       WORKING-STORAGE SECTION.
       77  WRK-FIM-ARQUIVO PIC X(01) VALUE 'N'.
       77  WRK-TOT-CONTAS PIC 9(06) VALUE ZEROS.
       77  WRK-TOT-SALDO PIC S9(13)V99 VALUE ZEROS.
       77  WRK-AG-ANTERIOR PIC X(04) VALUE SPACES.
       77  WRK-SUB-SALDO PIC S9(13)V99 VALUE ZEROS.
       01  WRK-LINHA-DETALHE.
           05 FILLER PIC X(04) VALUE 'AG: '.
           05 WRK-DET-AG PIC X(04).
           05 FILLER PIC X(08) VALUE ' | C/C: '.
           05 WRK-DET-CC PIC X(08).
           05 FILLER PIC X(09) VALUE ' | NOME: '.
           05 WRK-DET-NOME PIC X(20).
           05 FILLER PIC X(10) VALUE ' | SALDO: '.
           05 WRK-DET-SALDO PIC -ZZZZZZZZZ9,99.
           05 FILLER PIC X(08) VALUE ' | TIPO:'.
           05 WRK-DET-TIPO PIC X(01).
           05 FILLER PIC X(33) VALUE SPACES.
       01  WRK-LINHA-SUBTOTAL.
           05 FILLER PIC X(24) VALUE 'SUBTOTAL SALDO AGENCIA: '.
           05 WRK-SUB-VAL PIC -ZZZZZZZZZZZZ9,99.
           05 FILLER PIC X(91) VALUE SPACES.
       01  WRK-LINHA-TOT-CONTA.
           05 FILLER PIC X(17) VALUE 'TOTAL DE CONTAS: '.
           05 WRK-TOT-C-OUT PIC ZZZ.ZZ9.
           05 FILLER PIC X(108) VALUE SPACES.
       01  WRK-LINHA-TOTAL.
           05 FILLER PIC X(13) VALUE 'SALDO TOTAL: '.
           05 WRK-TOT-S-OUT PIC -ZZZZZZZZZZZZ9,99.
           05 FILLER PIC X(102) VALUE SPACES.
       01  WRK-TRACINHOS PIC X(132) VALUE ALL '_'.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           PERFORM ABRIR-ARQUIVOS THRU ABRIR-ARQUIVOS-FIM.
           IF WRK-FIM-ARQUIVO = 'N'
               MOVE AGENCIA TO WRK-AG-ANTERIOR.
           PERFORM FLUXO-PROCESSAMENTO THRU FLUXO-PROCESSAMENTO-FIM
               UNTIL WRK-FIM-ARQUIVO = 'S'.
           IF WRK-TOT-CONTAS NOT = ZEROS
               PERFORM GRAVA-SUBTOTAL THRU GRAVA-SUBTOTAL-FIM.
           PERFORM EXIBIR-ESTATISTICAS THRU EXIBIR-ESTATISTICAS-FIM.
           PERFORM FECHAR-ARQUIVOS THRU FECHAR-ARQUIVOS-FIM.
           STOP RUN.
       ABRIR-ARQUIVOS.
           OPEN INPUT ARQ-CONTAS OUTPUT ARQ-SAIDA.
           MOVE ZEROS TO WRK-TOT-CONTAS.
           MOVE ZEROS TO WRK-TOT-SALDO.
           MOVE ZEROS TO WRK-SUB-SALDO.
           PERFORM LER-REGISTRO THRU LER-REGISTRO-FIM.
       ABRIR-ARQUIVOS-FIM.
           EXIT.
       FLUXO-PROCESSAMENTO.
           PERFORM PROCESSAR-REGISTRO THRU PROCESSAR-REGISTRO-FIM.
           PERFORM LER-REGISTRO THRU LER-REGISTRO-FIM.
       FLUXO-PROCESSAMENTO-FIM.
           EXIT.
       PROCESSAR-REGISTRO.
           IF AGENCIA NOT = WRK-AG-ANTERIOR
               PERFORM GRAVA-SUBTOTAL THRU GRAVA-SUBTOTAL-FIM
               MOVE AGENCIA TO WRK-AG-ANTERIOR.
           PERFORM ACUMULAR-ESTATISTICAS THRU ACUMULAR-ESTATISTICAS-FIM.
           PERFORM GERAR-LINHA-RELATORIO THRU GERAR-LINHA-RELATORIO-FIM.
       PROCESSAR-REGISTRO-FIM.
           EXIT.
       LER-REGISTRO.
           READ ARQ-CONTAS
               AT END MOVE 'S' TO WRK-FIM-ARQUIVO.
       LER-REGISTRO-FIM.
           EXIT.
       ACUMULAR-ESTATISTICAS.
           ADD 1 TO WRK-TOT-CONTAS.
           ADD SALDO TO WRK-TOT-SALDO.
           ADD SALDO TO WRK-SUB-SALDO.
       ACUMULAR-ESTATISTICAS-FIM.
           EXIT.
       GERAR-LINHA-RELATORIO.
           MOVE AGENCIA TO WRK-DET-AG.
           MOVE NUM-CONTA TO WRK-DET-CC.
           MOVE NOME-CLIENTE TO WRK-DET-NOME.
           MOVE SALDO TO WRK-DET-SALDO.
           MOVE TIPO-CONTA TO WRK-DET-TIPO.
           WRITE REG-SAIDA FROM WRK-LINHA-DETALHE.
       GERAR-LINHA-RELATORIO-FIM.
           EXIT.
       GRAVA-SUBTOTAL.
           MOVE WRK-SUB-SALDO TO WRK-SUB-VAL.
           WRITE REG-SAIDA FROM WRK-LINHA-SUBTOTAL.
           WRITE REG-SAIDA FROM WRK-TRACINHOS.
           MOVE ZEROS TO WRK-SUB-SALDO.
       GRAVA-SUBTOTAL-FIM.
           EXIT.
       EXIBIR-ESTATISTICAS.
           MOVE WRK-TOT-CONTAS TO WRK-TOT-C-OUT.
           MOVE WRK-TOT-SALDO TO WRK-TOT-S-OUT.
           WRITE REG-SAIDA FROM WRK-LINHA-TOT-CONTA.
           WRITE REG-SAIDA FROM WRK-LINHA-TOTAL.
       EXIBIR-ESTATISTICAS-FIM.
           EXIT.
       FECHAR-ARQUIVOS.
           CLOSE ARQ-CONTAS ARQ-SAIDA.
       FECHAR-ARQUIVOS-FIM.
           EXIT.
