//BUILDCLI JOB (COBOL),'BUILD CLIE',CLASS=A,MSGCLASS=X,
//         MSGLEVEL=(1,1),NOTIFY=HERC01,REGION=4096K,TIME=1440
//JOBPROC  DD DISP=SHR,DSN=HERC01.KICKSSYS.V1R5M0.PROCLIB,
//         SYSPROC=YES
//CLIPGM   EXEC K2KCOBCL
//COPY.SYSUT1 DD DISP=SHR,DSN=HERC01.LIB.COBOL(CLIPGM)
//LKED.SYSLMOD DD DISP=SHR,
//         DSN=HERC01.KICKS.V1R5M0.KIKRPL(CLIPGM)
//LKED.SYSIN DD *
 INCLUDE SKIKLOAD(KIKCOBGL)
 ENTRY CLIPGM
 NAME CLIPGM(R)
/*
