//HERC01C  JOB  (COBOL),'COMPILE EXE',CLASS=A,MSGCLASS=X
//COMPLINK EXEC COBUCL
//COB.SYSLIB   DD DSN=HERC01.LIB.COPYLIB,DISP=SHR
//COB.SYSIN    DD DSN=HERC01.LIB.COBOL(PROG05),DISP=SHR
//COB.SYSPUNCH DD DUMMY
//LKED.SYSLMOD DD DSN=HERC01.PRIVLIB.LOAD(PROG05),DISP=SHR
//LKED.SYSIN   DD DUMMY
//
