//HERC01R  JOB  (COBOL),'RUN PROG05',CLASS=A,
//             MSGCLASS=X,NOTIFY=HERC01
//*
//* SORT CLIENT FILE BY CLIENT ID
//*
//SORTCLI  EXEC PGM=SORT
//SORTLIB  DD DSN=SYS1.SORTLIB,DISP=SHR
//SYSOUT   DD SYSOUT=*
//SORTIN   DD DSN=HERC01.CLIENTES.TXT,DISP=SHR
//SORTOUT  DD DSN=HERC01.CLIENTES.ORD,DISP=OLD
//SYSIN    DD *
  SORT FIELDS=(1,5,CH,A)
//SORTTRX  EXEC PGM=SORT
//SORTLIB  DD DSN=SYS1.SORTLIB,DISP=SHR
//SYSOUT   DD SYSOUT=*
//SORTIN   DD DSN=HERC01.TRANSAC.TXT,DISP=SHR
//SORTOUT  DD DSN=HERC01.TRANSAC.ORD,DISP=OLD
//SYSIN    DD *
  SORT FIELDS=(1,5,CH,A,6,5,CH,A)
//RUNSTEP  EXEC PGM=PROG05,COND=(4,LT)
//STEPLIB  DD DSN=HERC01.PRIVLIB.LOAD,DISP=SHR
//CLIENTES DD DSN=HERC01.CLIENTES.ORD,DISP=SHR
//TRANSAC  DD DSN=HERC01.TRANSAC.ORD,DISP=SHR
//ATUAL    DD DSN=HERC01.ATUAL.TXT,DISP=OLD
//ERROS    DD DSN=HERC01.ERROS.TXT,DISP=OLD
//SAIDA    DD SYSOUT=*,
//            DCB=(RECFM=F,LRECL=132,BLKSIZE=132)
//SYSOUT   DD SYSOUT=*
//SYSIN    DD DUMMY
//
