//HERC01R  JOB  (COBOL),'RUN PROGO4',CLASS=A,MSGCLASS=X,NOTIFY=HERC01
//SORTSTEP EXEC PGM=SORT
//SORTLIB  DD DSN=SYS1.SORTLIB,DISP=SHR
//SYSOUT   DD SYSOUT=*
//SORTIN   DD DSN=HERC01.CONTAS.TXT,DISP=SHR
//SORTOUT  DD DSN=HERC01.CONTAS.ORD,DISP=OLD
//SYSIN    DD *
  SORT FIELDS=(39,4,CH,A)
//RUNSTEP  EXEC PGM=PROGO4,COND=(4,LT,SORTSTEP)
//STEPLIB  DD DSN=HERC01.PRIVLIB.LOAD,DISP=SHR
//ENTRADA  DD DSN=HERC01.CONTAS.ORD,DISP=SHR
//TRANSAC  DD DSN=HERC01.CONTAS.ORD,DISP=SHR
//ATUAL  DD DSN=HERC01.CONTAS.ORD,DISP=SHR
//ERROS  DD DSN=HERC01.CONTAS.ORD,DISP=SHR
//SAIDA    DD SYSOUT=*,
//            DCB=(RECFM=F,LRECL=132,BLKSIZE=132)
//SYSOUT   DD SYSOUT=*
//SYSIN    DD DUMMY
//
