//VSAMCLIE JOB (COBOL),'VSAM CLIE',CLASS=A,MSGCLASS=X,
//         MSGLEVEL=(1,1),NOTIFY=HERC01,REGION=4096K,TIME=1440
//APAGA    EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  DELETE HERC01.CLIENTES.CLIE.KSDS CLUSTER PURGE
  IF LASTCC = 8 THEN SET MAXCC = 0
/*
//CRIA     EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  DEFINE CLUSTER (NAME(HERC01.CLIENTES.CLIE.KSDS) -
                  INDEXED -
                  UNIQUE -
                  KEYS(6 0) -
                  RECORDSIZE(80 80) -
                  TRACKS(5 1) -
                  VOLUMES(WORK01) -
                  SHAREOPTIONS(2 3)) -
         DATA (NAME(HERC01.CLIENTES.CLIE.KSDS.DATA)) -
         INDEX (NAME(HERC01.CLIENTES.CLIE.KSDS.INDEX))
/*
//ENTRADA  EXEC PGM=IEBGENER
//SYSPRINT DD SYSOUT=*
//SYSIN    DD DUMMY
//SYSUT1   DD *
000001HENRIQUE BATISTA              319999900000001BELO HORIZONTE               
000002MARIA CLAUDIA                 319999900000002BELO HORIZONTE               
000003VINICIUS JUNIOR               219999900000003RIO DE JANEIRO               
000004GABRIELA SILVA                319999900000004CONTAGEM                     
000005HUGO VICTOR                   319999900000005BETIM                        
000006CAMILA BRAGA                  319999900000006SABARA                       
/*
//SYSUT2   DD DSN=&&ENTCLI,DISP=(NEW,PASS),UNIT=SYSDA,
//         SPACE=(TRK,(1,1)),DCB=(RECFM=FB,LRECL=80,BLKSIZE=800)
//CARGA    EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//ENTRADA  DD DSN=&&ENTCLI,DISP=(OLD,DELETE)
//SYSIN    DD *
  REPRO INFILE(ENTRADA) OUTDATASET(HERC01.CLIENTES.CLIE.KSDS)
/*
